(function ($) {
    $(document).ready(function () {
        /*************************************************
        * 内容を修正するボタン押下時に値を保持して画面遷移する
        **************************************************/
        $("#return_button").click(function () {
            url = '../changeMember/';
            $('form').attr('action', url);
            $('form').submit();
        });

        /******************************************
        * 次へボタン押下時にDBの値を更新して登録修正完了画面に画面遷移する。
        *******************************************/
        // $("#next_button").click(function () {
            
        // });

    });


})(jQuery);